// 1) რას ნიშნავს რომ JavaScript იყო სკრიპტინგის ენა და მერე გახდა პროგრამირების ენა?

// თავიდან JavaScript გამოიყენებოდა მხოლოდ პატარა მოქმედებებისთვის ვებსაიტებზე.
// მაგალითად:
// ღილაკზე დაკლიკება
// ტექსტის შეცვლა
// ფორმის შემოწმება

// ამიტომ მას ერქვა სკრიპტინგის ენა,
// რადგან ბრაუზერში მცირე სკრიპტებს ასრულებდა.

// მოგვიანებით JavaScript ძალიან განვითარდა.
// დაემატა:
// Node.js
// სერვერის შექმნა
// მონაცემთა ბაზებთან მუშაობა
// აპლიკაციების შექმნა
// თამაშები და ა.შ.

// ამის შემდეგ JavaScript გახდა სრულფასოვანი პროგრამირების ენა.





// undefined -> მნიშვნელობა არ აქვს
// null -> ცარიელი მნიშვნელობა ჩვენ მივანიჭეთ



// 3) რას აკეთებს .length ?

// .length აბრუნებს სიმბოლოების ან ელემენტების რაოდენობას.


let text = "Hello";
console.log(text.length); // 5



let word = "საქართველო";
console.log(word.length); // 10




// 4) რას აკეთებს .toUpperCase() ?

// .toUpperCase() ტექსტს დიდ ასოებად აქცევს.


// მაგალითი 1
let name1 = "giorgi";
console.log(name1.toUpperCase()); // GIORGI


// მაგალითი 2
let city = "tbilisi";
console.log(city.toUpperCase()); // TBILISI


// მაგალითი 3
let text2 = "hello world";
console.log(text2.toUpperCase()); // HELLO WORLD