# 3) კომენტარებით ახსენით რა არის default პარამეტრი და რაში შეიძლება ის დაგვჭირდეს

# 4) შექმენით ფუნქცია, რომელსაც გადაეცემა default პარამეტრი სახელად name. for ციკლის მეშვეობით გადაუარეთ 
# გადმოცემულ name პარამეტრს და დაბეჭდეთ სახელის თითოეული სიმბოლო.

# თუ გამოძახებისას ფუნქციას არგუმენტი არ გადაეცა for ციკლით უნდა გადაუაროთ 
# თქვენს სახელს, ანუ name პარამეტრის მნიშვნელობა default-ათ უნდა იყოს თქვენი სახელი.




# default პარამეტრი არის ფუნქციის პარამეტრი, რომელსაც უკვე აქვს წინასწარ განსაზღვრული მნიშვნელობა.
# ეს ნიშნავს, რომ ფუნქციის გამოძახებისას თუ არგუმენტს არ გადავცემთ,
# მაშინ გამოყენებული იქნება ეს default მნიშვნელობა.


def print_letters(name="Giorgi"):

    for letter in name:

        print(letter)



print_letters("Nika")

print_letters()