#2)თქვენი სიტყვებით ახსენით, თუ რა არის დეკლარაცია, ინიციალიზება და რეინიციალიზება.

#დეკლარაცია - დეკლარაცია ეს არის ცვლადის შექმნა

#ინიციალიზება - ცვლადისთვის მნიშვნელობის მინიჭება 

#რეინიციალიზება - ცვლადისთვის მნიშვნელობის ხელახლა მინიჭება

#3)შექმენით ცვლადი, შეუცვალეთ მას მნიშვნელობა 3-ჯერ. თითოეული მნიშვნელობის შეცვლის შემდეგ დაბეჭდეთ ეს ცვლადი.

name = "George"

movie = "The Shawshank Redemption"

item = "ball"


#4) შექმენით 5 ცვლადი, სადაც შეინახავთ რიცხვებს. დაბეჭდეთ მათი ჯამი print ფუნქციის გამოყენებით.

num = 2
num2 = 33
num3 = 22
num4 = 14
num5 = 7

print(num + num2 + num3 + num4 + num5)

#5) მართკუთხედის პერიმეტრი:
#   შექმენით ორი ცვლადი length და width(მართკუთხედის გვერდები), მიანიჭეთ მნიშვნელობებად 20 და 10. გამოითვალეთ მართკუთხედის პერიმეტრი და დაბეჭდეთ.

length = 20

width = 10

perimeter = 2 * (length + width)

print(perimeter)