
# 2) კოემნტარებით ახსენით რა არის "კომენტარი", როგორ უნდა შევქმნათ ის პითონში

# კომენტარი- არის მონაცემი რომელსაც მხოლოდ ჩვენ ვხედავთ და კომპიუტერი ვერ აღიქვამს მას. პითონში მისი შექმნა #-ით არის შესაძლებელი


# 3) კომენტარებით ახსენით რა არის ქეის სენსიტიურობა და მოიყვანეთ რამოდენიმე მაგალითი

#  ქეის სენსიტიურობა- პითონში ქეის სენსიტიური ენა რაგანაც A და a -ს სხვადასხვაგვარად აღიქვავს 

num = 33
Num = 11
NUM = 55

print(num)
print (Num)
print(NUM)


# 4) კომენტარებით ახსენით რა არის snake_case-ი და შექმენით მისი გამოყენებით რამოდენიმე ცვლადი

# snake_case-ეს არის ცვლადის შექმნის ერთერთი ტიპი რომელიც გამოყოფს სხვადასხვა სიტყვებს ერთმანეთისგან რადგან ჩვენთვის მარტივად გასარჩევი იყოს.

name_surname ="George Qubiashvili"
favorite_car_brand = "BMW"

print(name_surname)
print(favorite_car_brand)

# 5) კომენტარებით ახსენით რა არის debugging-ი.

# debugging-Eror-ის შეცდომების გამოსწორება კოდში


# გამოასწორეთ შეცდომები შემდეგ კოდში:

# print("Hello World)
# city = "London"
# pritn(City)



print("Hello World")
city = "London"
print(city)
