// 1) შექმენით ფუნქცია რომელსაც გადაეცემა ერთი რიცხვი არგუმენტად.
//  თუ ეს რიცხვი ნაკლებია 100 ზე, მაშინ უნდა დააბრუნოთ რიცხვის 10%, 
// თუ 200 ზე ნაკლებია 20%, სხვა შემთხვევაში 30% (ფორმულა: num / x% * 100). შექმენით სამივე ფუნქციის შექმნის გზით
// 2) რა შემთხვევაში ქვია ფუნქციას anonymous ფუნქცია?
// 3) რა არის პარამეტრი და არგუმენტი
// 4) რა არის default პარამეტრი?
// 5) ფუნქციას უნდა გადაეცეს ერთი რიცხვი, თუ ეს რიცხვი მეტია 10 ზე დააბრუნეთ true, სხვა შემთხვევაში false(გააკეთეთ arrow ფუნქციით ერთ ხაზში)

function numfun(num){
    if(num < 100){
        return num * 0.1;
    } else if(num < 200){
        return num * 0.2;
    } else {
        return num * 0.3;
    }
}

console.log(numfun(50)); // 5


// 2) რა შემთხვევაში ქვია ფუნქციას anonymous ფუნქცია?
// Anonymous function (ანონიმური ფუნქცია) არის ფუნქცია, რომელსაც სახელი არ აქვს.




// პარამეტრი  — ცვლადია რომელიც ფუნქციის შექმნის დროს ფრჩხილებში იწერება.

// არგუმენტი  — მნიშვნელობაა რომელსაც ფუნქციის გამოძახების დროს გადავცემთ.


// Default პარამეტრი არის პარამეტრი,
// რომელსაც წინასწარ აქვს მინიჭებული მნიშვნელობა. 
// თუ ფუნქციის გამოძახებისას არგუმენტს არ გადავცემთ 
// გამოიყენება ეს მნიშვნელობა.

const checkNumber = num => num > 10 ? true : false; 
console.log(checkNumber(15)); // true
console.log(checkNumber(5)); // false