'''

    loop(ციკლი)-ნიშნავს ერთიდაიგივე კოდის გამეორება იმდენჯერ რამდენჯერაც საჭიროა (იტერაციების ერთობლიობა)

    კომენტარებით ახსენით რა არის range ფუნქცია და დეტალურად ისაუბრეთ მასზე(განიხილეთ არგუმენტების გადაცემის ყველა ვარიანტი)

    range() არის ჩაშენებული Python ფუნქცია,ქმნის რიცხვთა დიაპაზონს. აუცილებლად უნდა გადავცეთ-'()' მის გამოძასახებლად range ფუნქციას აუცილებლად უნდა გადაეცეს 
    ფრჩხილებში არგუმენტი ამ კომკრეტულ შემთხვევაში მაქსიმუმ 3-არგუმენტი. არგუმენტი აუცილებლად უნდა იყოს მთელი რიცხვი

    range(Start;Stop;Step)



 '''

# 4) დაბეჭდეთ 100-დან 200-ის ჩათვლით ყველა რიცხვი

for i in range(100,201):
    print(i)
# 5) დაბეჭდეთ 20-დან 30-მდე ყოველი მესამე რიცხვი

for i in range(20,31,3):
    print(i)    
# 6) დაბეჭდეთ 0-დან 20-ის ჩათვლით ყველა ლუწი რიცხვი

for i in range(2,21,2):
    print(i)                
# 7) for ციკლის გამოყენებით მომხმარებელს შემოატანინეთ 5 რიცხვი და საბოლოოდ დაბეჭდეთ მათი საშუალო არითმეტიკული

num = 0

for i in range(5):
    userinput=float(input("Enter any number: "))    

    num += userinput
average = num / 5

print(average)