# 2) კომენტარების სახით ახსენით თუ რა დანიშნულება აქვთ .append(); .insert() და .pop() ფუნქციებს.

# .append() ფუნქცია გამოიყენება სიის ბოლოში ახალი ელემენტის დასამატებლად

# .insert() ფუნქცია გამოიყენება სიის კონკრეტულ index-ზე ელემენტის ჩასამატებლად

# .pop() ფუნქცია გამოიყენება სიიდან ელემენტის ამოსაშლელად



# 3) შექმენით რამდენიმე ელენტისგან შემდგარი სია, თქვენი დავალებაა დაბეჭდოთ ამ სიის სიგრძე, ანუ სიაში არსებული ელემენტების რაოდენობა.

list = [1, 2, 4, 5, 6]

print(len(list))


# 4) შექმენით ცარიელი სია სადაც მომხმარებელს 5-ჯერ შემოატანინენებთ რიცხვს, შემდეგ კი დაამატებთ მას სიის ბოლოში append() ფუნქციით.

list1 = []

for i in range(5):
    num = int(input("enter number"))
    list1.append(num)
print(list1)


# 5) მოცემულია სია:
colors = ["red", "green", "blue", "yellow", "purple"]
# თქვენი დავალებაა სიიდან წაშალოთ ბოლო ელემენტი .pop() მეთოდის დახმარებით, შემდეგ კი დაბეჭდოთ განახლებული სია.

colors.pop()
print(colors)

# 6) მოცემულია სია:
animals = ["dog", "cat", "elephant", "lion"]
# თქვენი დავალებაა insert() მეთოდით ჩასვათ სიტყვა "monkey" სიაში მეორე პოზიციაზე, რის შემდეგაც დაბეჭდავთ განახლებულ სიას.

animals.insert(1, "monkey")
print(animals)


# 7) შემქნით ცარიელი სია, სადაც 3-ჯერ input-ის სახით მომხმარებელს შეაყვანინებთ სამი სტუდენტის 
# სახელს და დაამატებთ სიაში append() ფუნქციით. შემდეგ კი ჩასვით "Teacher" სიის თავში, წაშალეთ ბოლო სტუდენტი და დაბეჭდეთ სიის სიგრძე, ასვეე საბოლოო სია.

list2 = []

for i in range(3):
    name = input("enter your name: ")
    list2.append(name)
list2.insert(0, "Teacher")
list2.pop()
print(list2)
print(len(list2))

# 8) კომენტარებით ახსენით თუ რა არის custom ფუნქციები, რისთვის გამოვიყენებთ და რა დანიშნულება გააჩნიათ, ასევე ახსენით მისი შექმნის გზები ეტაპობრივად და ახსენეთ თუ რაა პარამეტრები და არგუმენტები.

# custom ფუნქცია არის პროგრამისტის მიერ შექმნილი ფუნქცია
# ანუ ფუნქცია, რომელსაც ჩვენ თვითონ ვწერთ და არა ჩაშენებულს (მაგ: print(), len())


# custom ფუნქციის შექმნა ხდება def  სიტყვის გამოყენებით

# ფუნქციის შექმნის ეტაპები:
# 1) ვწერთ def სიტყვას
# 2) ვწერთ ფუნქციის სახელს
# 3) ფრჩხილებში ვუთითებთ პარამეტრებს 
# 4) ვუსვამთ ორწერტილს :
# 5) შიგნით ვწერთ ფუნქციის კოდს 

# პარამეტრები არის ცვლადები,
# რომლებიც ფუნქციის შექმნის დროს იწერება ფრჩხილებში
# ისინი იღებენ მნიშვნელობებს ფუნქციის გამოძახებისას

# არგუმენტები არის რეალური მნიშვნელობები,
# რომლებიც ფუნქციის გამოძახების დროს გადაეცემა პარამეტრებს


def greet(name):
    print("Hello", name)


greet("George")  
