

#3) კომენტარებით ახსენით რა არის print-ი და რატომ ვიყენებთ ბრჩხილებს მისი წერისას
# print- არის ფუნქცია რომელიც გვეხმარება ტერმინალში შედეგის გამოტანაში ("შედეგი")
# ბრჩხილებს ვიყენებთ იმიტომ რომ მის გარეშე print ფუნქციისას ტერმინალში შედგეს ვერ მივიღბეთ
# ბრჩხილების მეშვეობით ვიძახებთ print-ფუნქციას


#4)
name = "GEORGE"
print(name)

#5) დეკლარაცა - ეს არის ცვლადის შექმნა.


#6)შექმენით ცვლადი სახელად number და გაუტოლეთ ის 10-ს,
#  შემდეგ დაბეჭდეთ ამ ცვლადის მნიშვნელობა print ფუნქციის გამოყენებით.
#  შემდეგ დაწერეთ იგივე ცვლადი და გაუტოლეთ იგი 20-ს. 
# საბოლოოდ ხელახლა დაბეჭდეთ
#  number ცვლადი და თქვენი სიტყვებით ახსენით რა მოხდა ამ კოდში

number = "10"
print(number)

number = "20"
print(number)

# ამ კოდში ავიღეთ ცვლადი number - რომელიც გავუტოლეთ 10 და 20-ს
# და დავბეჭდეთ print ფუნქციით.