# /  — ჩვეულებრივი გაყოფა 
# აბრუნებს გაყოფის ზუსტ შედეგს ათწილადის სახით (float)

print(10 / 2)   # 5.0
print(7 / 2)    # 3.5
print(9 / 3)    # 3.0

# // — მთლიანი გაყოფა 
# აბრუნებს მხოლოდ მთელ ნაწილს 

print(10 // 2)  # 5
print(7 // 2)   # 3
print(9 // 4)   # 2

# % — ნაშთიანი გაყოფა 
# აბრუნებს გაყოფის შემდეგ დარჩენილ ნაშთს

print(10 % 2)   # 0
print(7 % 2)    # 1
print(9 % 4)    # 1

'''
 elif ნიშნავს "else if"-ს
 ის გამოიყენება მაშინ როცა გვინდა რამდენიმე პირობის შემოწმება ერთმანეთის შემდეგ
 თუ if პირობა არ შესრულდა პროგრამა ამოწმებს elif პირობას
 შეიძლება გვქონდეს რამდენიმე elif
 შესრულდება მხოლოდ ის ხაზი რომლის პირობაც პირველად გახდება True

'''

'''
    წელი ნაკიანია თუ:

იყოფა 400-ზე - ნაკიანია

იყოფა 100-ზე მაგრამ არა 400-ზე - არ არის ნაკიანი

იყოფა 4-ზე მაგრამ არა 100-ზე - ნაკიანია

სხვა ყველა შემთხვევაში - არ არის ნაკიანი


'''
user_input = int(input("Enter Year: "))

if user_input % 400 == 0:
    print("წელი ნაკიანი")
elif user_input % 100 == 0:
    print("წელი არ არის ნაკიანი")
elif user_input % 4 == 0:
    print("წელი ნაკიანია")
else:
    print("წელი არ არის ნაკიანი")